Tekla Open API Reference for Tekla Structures 2025
ModelObjectSelector.GetObjectsByFilter Method
 Returns an enumerator of the model objects in the current model selected by the given selection filter definition.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ModelObjectEnumerator GetObjectsByFilter(
	FilterExpression FilterExpression
)
Public Function GetObjectsByFilter (
	FilterExpression As FilterExpression
) As ModelObjectEnumerator
Parameters
FilterExpression
Type: Tekla.Structures.Filtering.FilterExpression
The definition of a selection filter to apply.
Return Value
Type: ModelObjectEnumerator
A model object enumerator of the objects selected by the filter.
See Also
Reference
ModelObjectSelector Class
Tekla.Structures.Model Namespace